function hi() {
  console.log("Hello World!");
}
hi();
const moment = require("moment-timezone");
module.exports.config = {
  'name': 'autotime',
  'version': "2.0.0",
  'role': 0x0,
  'author': "MR᭄﹅ MAHABUB﹅ メꪜ",
  'description': "autotime",
  'category': "AutoTime",
  'countDown': 0x3
};
module.exports.onLoad = async ({
  api: _0x1d5129
}) => {
  const _0x1aca94 = {
    "12:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "01:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "02:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "03:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "04:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "04:30:00 AM": {
      'message': "╭──────────────────╮\n  🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)"
    },
    "05:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "06:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "07:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "08:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "09:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "10:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "11:00:00 AM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "12:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "01:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "02:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "03:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "04:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "05:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "06:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "06:30:00 PM": {
      'message': "╭──────────────────╮\n  🌸 𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)"
    },
    "07:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "08:00:00 PM": {
      'message': ""
    },
    "09:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "10:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    },
    "11:00:00 PM": {
      'message': "✦━━━━━━━━━━━━━━━━✦\n𝐌𝐄𝐇𝐄𝐑𝐀𝐙 𝐁𝐎𝐓🙂🎀\n✦━━━━━━━━━━━━━━━━✦"
    }
  };
  const _0x2c827b = () => {
    const _0xde61e3 = moment().tz("Asia/Dhaka");
    const _0x36cc76 = _0xde61e3.format("hh:mm:ss A");
    const _0x3185db = _0x1aca94[_0x36cc76];
    if (_0x3185db) {
      const _0x4c3da8 = global.db.allThreadData.map(_0x16cca0 => _0x16cca0.threadID);
      _0x4c3da8.forEach(async (_0x15884f, _0x53e397) => {
        _0x1d5129.sendMessage({
          'body': _0x3185db.message
        }, _0x15884f);
      });
    }
    const _0x5be7d3 = moment().add(0x1, 'minute').startOf('minute');
    const _0x39a664 = _0x5be7d3.diff(moment());
    setTimeout(_0x2c827b, _0x39a664);
  };
  _0x2c827b();
};
module.exports.onStart = () => {};
